// Створіть об'єкт з щонайменше трьома властивостями (намагайтесь виявити фантазію). 
//Напишіть метод getInfo(), який виводитиме всі властивості об'єкта у вигляді пар "ключ: значення". 
//Зверніть увагу: метод повинен працювати навіть після додавання нових властивостей до об'єкта. 

// Наприклад так:

// obj.getInfo(); // Правильна інформація про об'єкт
// obj.newProperty = 'Нова властивість!'; // Додали властивість до об'єкта
// obj.getInfo(); // Виводить всі властивості, включаючи щойно додану.

book = {
    "author": 'George Orwell',
    'year' : '1949',
    'name' : '1984',
    
    getInfo: function () {
        for (let i in this) {
            if (i!='getInfo') {
                console.log(i + ': '+ this[i])
            }
        } 
    }
}

book.getInfo()
book.price=30
book.getInfo()
